#include "Functions.h"

int _stateMenu,
    _mainMenu,
    _actionMenu;
void zeroMenu()
{
	cout << "Виберіть дію: " << endl
		<< "-----------------" << endl
		<< "(0) Вихід з програми" << endl
		<< "------------------------" << endl
		<< "(1) Робота з данними та файлами" << endl
		<< "-------------------------------" << endl
		<< "(2) Робота та аналітика данних" << endl
		<< "------------------------------" << endl
		<< "Ваш вибір: ";
	cin >> _stateMenu;
}

void firstMenu()
{
	cout << "Виберіть дію: " << endl
		<< "---------------" << endl
		<< "(1) ВВід данних" << endl
		<< "----------------" << endl
		<< "(2) Вивід данних" << endl
		<< "-----------------" << endl
		<< "(3) Заміна данних" << endl
		<< "-------------------" << endl
		<< "(4) Додавання данних" << endl
		<< "--------------------" << endl
		<< "(5) Вилучення данних" << endl
		<< "---------------------" << endl
		<< "(6) Сортування данних" << endl
		<< "---------------------" << endl
		<< "(7) Збереження данних" << endl
		<< "---------------------" << endl
		<< "(8) Назад" << endl
		<< "---------" << endl
		<< "Ваш вибір: ";
	cin >> _actionMenu;
}

void secondMenu()
{
	cout << "Виберіть дію: " << endl 
		<< "----------------------------------------------------------------------" << endl
		<< "(1) Вивід видів виробів в цілому та зазначеним цехом або підприємством" << endl
		<< "------------------------------------------------------------------------------------------------------------" << endl
		<< "(2) Вивід числа та переліку виробів окремої категорії і в цілому, зібраних зазначеним цехом, ділянкою, підприємством в цілому за певний відрізок часу" << endl
		<< "-----------------------------------------------------------------------------------------------------------------------------------------------------" << endl
		<< "(3) Вивід даних про кадровий склад цеху, підприємства в цілому і по зазначеним категоріям інженерно - технічного персоналу і робітників" << endl
		<< "---------------------------------------------------------------------------------------------------------------------------------------" << endl
		<< "(4) Вивід числа і переліку ділянок зазначеного цеху, підприємства в цілому та їх начальників" << endl
		<< "--------------------------------------------------------------------------------------------" << endl
		<< "(5) Вивід переліку робіт, які проходять для вказаного виробу" << endl
		<< "------------------------------------------------------------" << endl
		<< "(6) Вивід складу бригад зазначеної ділянки, цеху" << endl
		<< "-------------------------------------------------" << endl
		<< "(7) Вивід списку майстрів вказаної ділянки, цеху" << endl
		<< "----------------------------------------------------------------------------------" << endl
		<< "(8) Вивід переліку виробів окремої категорії що збираються зараз зазначеним цехом" << endl
		<< "----------------------------------------------------------------------------------------------------------------------" << endl
		<< "(9) Вивід складу бригад, яка бере участь в складанні зазначеного виробу" << endl
		<< "-------------------------------------------------------------------------------------" << endl
		<< "(10) Вивід переліку випробувальних лабораторій, що беруть участь у випробуваннях деякого конкретного виробу" << endl
		<< "-----------------------------------------------------------------------------------------------------------------" << endl
		<< "(11) Вивід переліку виробів окремої категорії і в цілому, що проходили випробування у зазначеній лабораторії за певний період" << endl
		<< "-----------------------------------------------------------------------------------------------------------------------------" << endl
		<< "(12) Вивід списку випробувачів, що беруть участь у випробуваннях в деякій лабораторії за певний період" << endl
		<< "--------------------------------------------------------------------------------------------------------" << endl
		<< "(13) Вивід складу обладнання, що використовувалося при випробуванні, в деякій лабораторії за певний період" << endl
		<< "------------------------------------------------------------------------------------------------------------------------------" << endl
		<< "(14) Вивід числа і переліку виробів окремої категорії і в цілому, що збираються зазначеним цехом, ділянкою, підприємством в цілому в даний час" << endl
		<< "----------------------------------------------------------------------------------------------------------------------------------------------" << endl
		<< "(15) Назад" << endl
		<< "----------" << endl
		<< "Ваш вибір: ";
	cin >> _mainMenu;
}

int main()
{
	//налаштування розміру консолі
	HWND console = GetConsoleWindow();
	RECT r;
	GetWindowRect(console, &r); //зберігає поточні розміри консолі

	MoveWindow(console, r.left, r.top, 1280, 720, TRUE); // 1280 ширина, 720 висота

	//ураїнізація консолі вводу/виводу
	SetConsoleCP(1251);// встановлення кодування Windows-1251 в  потік введення
	SetConsoleOutputCP(1251);// встановлення кодування Windows-1251 в  потік виведення

	zeroMenu();
	int    _actions = 0,
		   choice = 0,
		   department = 0,
		   hour = 0,
		   part = 0,
		   _time = 0;

	string fileName,
		   fileName4P,
		   category,
		   item;

	int _size = 0;//кількість данних
	int _capacity = 0;//кількість данних людей
	Data* d = new Data[_size];
	People* p = new People[_capacity];
	//тимчасова конструкція
	fileName = "test.txt";
	fileName4P = "test4P.txt";
	DataReading(d, _size, fileName);
	PeopleReading(p, _capacity, fileName4P);
	//піп

	while (_stateMenu != 0)
	{
		switch (_stateMenu)
		{
		case 1:
			system("cls");//очистка консолі

			firstMenu();
			while (_actionMenu != 0)
			{
				switch (_actionMenu)
				{
				case 1:
					system("cls");//очистка консолі

					cout << "Ввести данні (1/2)власноруч або (3)зчитати з файлу?: ";
					cin >> _actions;

					system("cls");//очистка консолі

					if (_actions == 1)
					{
						DataEntry(d, _size);//ввід власноруч
					}
					else if (_actions == 2)
					{
						PeopleEntry(p, _capacity);
					}
					else if (_actions == 3)
					{
						cout << "Уведіть назву файлу (з .txt): ";
						cin >> fileName;

						DataReading(d, _size, fileName);
					}
					else
					{
						system("cls");//очистка консолі
						cout << "error";
					}
					system("pause");//затримка консолі
					system("cls");//очистка консолі
					firstMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 2:
					system("cls");//очистка консолі
					if (_size != 0)
						Print(d, _size);
					else
						cout << "Данні пусті" << endl;

					system("pause");//затримка консолі
					system("cls");//очистка консолі
					firstMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 3:
					system("cls");//очистка консолі
					if (_size != 0)
						DataChange(d, _size);
					else
						cout << "Данні пусті" << endl;

					system("pause");//затримка консолі
					system("cls");//очистка консолі
					firstMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 4:
					system("cls");//очистка консолі
					if (_size != 0)
						AddData(d, _size);
					else
						cout << "Данні пусті" << endl;

					system("pause");//затримка консолі
					system("cls");//очистка консолі
					firstMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 5:
					system("cls");//очистка консолі
					if (_size != 0)
						DeleteData(d, _size);
					else
						cout << "Данні пусті" << endl;

					system("pause");//затримка консолі
					system("cls");//очистка консолі
					firstMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 6:
					system("cls");//очистка консолі
					if (_size != 0)
						SortingData(d, _size);
					else
						cout << "Данні пусті" << endl;

					system("pause");//затримка консолі
					system("cls");//очистка консолі
					firstMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 7:
					system("cls");//очистка консолі

					if (_size != 0)
					{
						cout << "Уведіть бажаєму назву для файлу(test.txt): ";
						cin >> fileName;

						SaveData(d, _size, fileName);
					}
					else
						cout << "Данні пусті" << endl;

					if (_size != 0)
					{
						cout << "Уведіть бажаєму назву для файлу(test.txt): ";
						cin >> fileName4P;

						SavePeople(p, d, _capacity, fileName4P);
					}
					else
						cout << "Данні пусті" << endl;

					system("pause");//затримка консолі
					system("cls");//очистка консолі
					firstMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 8:
					system("cls");//очистка консолі
					_actionMenu = 0;
					break;
					//////////////////////////////////////////////////////////////////
				default:
					cout << "Пункт меню був вибран невірно" << endl;
					system("pause");//затримка консолі
					system("cls");//очистка консолі
					firstMenu();
				}
			}
			zeroMenu();
			break;
			//////////////////////////////////////////////////////////////////
		case 2:
			system("cls");//очистка консолі
			secondMenu();
			while (_mainMenu != 0)
			{
				switch (_mainMenu)
				{
				case 1:
					system("cls");//очистка консолі
					if (_size != 0) 
					{
						cout << "Виберіть дію: " << endl
							<< "------------------------------" << endl
							<< "(1) Вивід видів виробів в цілому, зазначеним цехом" << endl
							<< "------------------------------------------------------" << endl
							<< "(2) Вивід видів виробів окремої категорії, зазначеним цехом" << endl
							<< "-----------------------------------------------------------" << endl
							<< "(3) Вивід видів виробів в цілому, підприємством" << endl
							<< "--------------------------------------------------" << endl
							<< "(4) Вивід видів виробів окремої категорії, підприємством" << endl
							<< "----------" << endl
							<< "Ваш вибір: ";
						cin >> choice;

						if (choice == 1) {
							system("cls");//очистка консолі
							cout << "Уведіть номер цеху: ";
							cin >> department;
							system("cls");//очистка консолі
							Types(d, _size, department);
						}
						else if (choice == 2)
						{
							cout << "Уведіть назву категорії: ";
							cin >> category;
							cout << "Уведіть номер цеху: ";
							cin >> department;
							system("cls");//очистка консолі

						specialTypes(d, _size, department, category);
						}
						else if (choice == 3)
						{
							system("cls");//очистка консолі
							cout << "<-Вироби в цілому->" << endl;
							sortTypes(d, _size);
						}
						else if (choice == 4)
						{
							cout << "Уведіть назву категорії: ";
							cin >> category;
							system("cls");//очистка консолі
							cout << "<-Вироби в категорі: " << category << " ->" << endl;
							specSortTypes(d, _size, category);
						}
						else
						{
							cout << "Пункт меню був вибран невірно" << endl;
						}
					}
					else
					{
						cout << "Данні пусті" << endl;
					}
					system("pause");//затримка консолі
					system("cls");//очистка консолі
					secondMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 2:
					system("cls");//очистка консолі
					if (_size != 0) 
					{
						cout << "Виберіть дію та зазначте час роботи(діб): " << endl
							 << "------------------------------------------" << endl
							 << "(1) Вивід видів виробів в цілому, зазначеним цехом за певний відпізок часу" << endl
							 << "------------------------------------------------------" << endl
							 << "(2) Вивід видів виробів окремої категорії, зазначеним цехом за певний відпізок часу" << endl
							 << "-----------------------------------------------------------" << endl
							 << "(3) Вивід видів виробів в цілому, підприємством за певний відпізок часу" << endl
							 << "--------------------------------------------------" << endl
							 << "(4) Вивід видів виробів окремої категорії, підприємством за певний відпізок часу" << endl
							 << "----------" << endl
							 << "Ваш вибір: ";
						cin  >> choice;
						cout << "Зазначте час роботи(діб): ";
						cin  >> _time;

						hour = 24 * _time;

						if (choice == 1) { 
							cout << " "<< endl;
							cout << "Уведіть номер цеху: ";
							cin >> department;

							system("cls");//очистка консолі
							TypesPerHour(d, _size, department, hour);
							system("pause");//затримка консолі
						}
						else if (choice == 2)
						{
							cout << " " << endl;
							cout << "Уведіть назву категорії: ";
							cin >> category;
							cout << "Уведіть номер цеху: ";
							cin >> department;
							
							system("cls");//очистка консолі
							specialTypesPerHour( d, _size, department, category, hour);
							system("pause");//затримка консолі
						}
						else if (choice == 3)
						{
							system("cls");//очистка консолі
							cout << "<-Вироби в цілому->" << endl;
							sortTypesPerHour(d, _size, hour);
							system("pause");//затримка консолі
						}
						else if (choice == 4)
						{
							cout << "Уведіть назву категорії: ";
							cin >> category;
							system("cls");//очистка консолі
							cout << "<-Вироби в категорі: " << category << " ->" << endl;
							specSortTypesPerHour(d, _size, category, hour);
							system("pause");//затримка консолі
						}
						else
						{
							cout << "Пункт меню був вибран невірно" << endl;
						}
					}
					else
					{
						cout << "Данні пусті" << endl;
					}
					system("cls");//очистка консолі
					secondMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 3:
					system("cls");//очистка консолі
					if (_size != 0)
					{
						 sortPeopleTypes(p, _capacity);
					}
					else
					{
						cout << "Данні пусті" << endl;
					}
					system("pause");//затримка консолі
					system("cls");//очистка консолі
					secondMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 4:
					system("cls");//очистка консолі
					if (_size != 0)
					{
						system("cls");//очистка консолі
						cout << "Уведіть номер цеху: ";
						cin >> department;
						system("cls");//очистка консолі
						Area(d, _size, department);
					}
					else
					{
						cout << "Данні пусті" << endl;
					}
					system("pause");//затримка консолі
					system("cls");//очистка консолі
					secondMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 5:
					system("cls");//очистка консолі
					if (_size != 0)
					{
						system("cls");//очистка консолі
						cout << "Уведіть назву деталі: ";
						cin >> item;
						system("cls");//очистка консолі
						workItem(d, _size, item);
					}
					else
					{
						cout << "Данні пусті" << endl;
					}
					system("pause");//затримка консолі
					system("cls");//очистка консолі
					secondMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 6:
					system("cls");//очистка консолі
					cout << "Вивід складу бригад зазначеної (1)ділянки, (2)цеху" << endl;
					cin >> choice;
					system("cls");//очистка консолі
					if (_capacity != 0 && choice == 1)
					{
						system("cls");//очистка консолі
						cout << "Уведіть ділянку: ";
						cin >> department;
						system("cls");//очистка консолі
						departmentGroop(p, _capacity, department);
					}
					else if (_capacity != 0 && choice == 2)
					{
						system("cls");//очистка консолі
						cout << "Уведіть цех: ";
						cin >> item;
						system("cls");//очистка консолі
						partGroop(p, _capacity, part);
					}
					else
					{
						cout << "Данні пусті" << endl;
					}
					system("pause");//затримка консолі
					system("cls");//очистка консолі
					secondMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 7:
					system("cls");//очистка консолі
					cout << "Вивід списку майстрів вказаної (1)ділянки, (2)цеху" << endl;
					cin >> choice;
					system("cls");//очистка консолі
					if (_capacity != 0 && choice == 1)
					{
						system("cls");//очистка консолі
						cout << "Уведіть ділянку: ";
						cin >> department;
						system("cls");//очистка консолі
						areaMasters(p, _capacity, department);
					}
					else if (_capacity != 0 && choice == 2)
					{
						system("cls");//очистка консолі
						cout << "Уведіть цех: ";
						cin >> item;
						system("cls");//очистка консолі
						departmentMasters(p, _capacity, part);
					}
					else
					{
						cout << "Данні пусті" << endl; 
					}
					system("pause");//затримка консолі
					system("cls");//очистка консолі
					secondMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 8:
					system("cls");//очистка консолі
					if (_size != 0)
					{
						system("cls");//очистка консолі
						cout << "Уведіть номер цеху: ";
						cin >> department;
						cout << "Уведіть категорію: ";
						cin >> category;
						system("cls");//очистка консолі
						assemblyItemsByCategory(d, _size, department, category);
					}
					else
					{
						cout << "Данні пусті" << endl;
					}
					system("pause");//затримка консолі
					system("cls");//очистка консолі
					secondMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 9:
					system("cls");//очистка консолі
					if (_size != 0 && _capacity != 0)
					{
						system("cls");//очистка консолі
						cout << "Уведіть виріб: ";
						cin >> item;
						system("cls");//очистка консолі
						assemblyCrewsByItem(p,d, _size,_capacity, item);
					}
					else
					{
						cout << "Данні пусті" << endl;
					}
					system("pause");//затримка консолі
					system("cls");//очистка консолі
					secondMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 10:
					system("cls");//очистка консолі
					if (_size != 0)
					{
						system("cls");//очистка консолі
						cout << "Уведіть назву деталі: ";
						cin >> item;
						system("cls");//очистка консолі
						testLabsByItem(p, d, _size, _capacity, item);
					}
					else
					{
						cout << "Данні пусті" << endl;
					}
					system("pause");//затримка консолі
					system("cls");//очистка консолі
					secondMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 11:
					system("cls");//очистка консолі
					if (_size != 0 && _capacity != 0)
					{
						system("cls");//очистка консолі
						cout << "Уведіть назву категорії: ";
						cin >> category;
						cout << "Зазначте час роботи(діб): ";
						cin >> _time;
						hour = 24 * _time;
						cout << "Уведіть номер цеху: ";
						cin >> department;
						system("cls");//очистка консолі
						productsByLabAndPeriod(p, d, _size, _capacity, department, category, hour);
					}
					else
					{
						cout << "Данні пусті" << endl;
					}
					system("pause");//затримка консолі
					system("cls");//очистка консолі
					secondMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 12:
					system("cls");//очистка консолі
					if (_size != 0 && _capacity != 0)
					{
						system("cls");//очистка консолі
						cout << "Зазначте час роботи(діб): ";
						cin >> _time;
						hour = 24 * _time;
						cout << "Уведіть номер цеху: ";
						cin >> department;
						system("cls");//очистка консолі
						testersByLabAndPeriod(p, d, _size, _capacity, department, hour);
					}
					else
					{
						cout << "Данні пусті" << endl;
					}
					system("pause");//затримка консолі
					system("cls");//очистка консолі
					secondMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 13:
					system("cls");//очистка консолі
					if (_size != 0 && _capacity != 0)
					{
						system("cls");//очистка консолі
						cout << "Зазначте час роботи(діб): ";
						cin >> _time;
						hour = 24 * _time;
						cout << "Уведіть номер цеху: ";
						cin >> department;
						system("cls");//очистка консолі
						equipmentByLabAndPeriod(p, d, _size, _capacity, department, hour);
					}
					else
					{
						cout << "Данні пусті" << endl;
					}
					system("pause");//затримка консолі
					system("cls");//очистка консолі
					secondMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 14:
					system("cls");//очистка консолі
					if (_size != 0 && _capacity != 0)
					{ 
						cout << "Вивід числа і переліку виробів окремої категорії і в  (3)цілому, що збираються зазначеним (1)цехом, (2)підприємством в цілому в даний час "<< endl;
						cin >> choice;
						if (choice == 1)
						{
							system("cls");//очистка консолі
							cout << "Уведіть кутегорію: ";
							cin >> category;
							cout << "Уведіть номер цеху: ";
							cin >> department;
							system("cls");//очистка консолі
							productsByCategoryAndDepartment(p, d, _size, _capacity, category, department);
						}
						else if (choice == 2)
						{
							system("cls");//очистка консолі
							cout << "Уведіть кутегорію: ";
							cin >> category;
							system("cls");//очистка консолі
							productsByCategoryCompanyWide(d, _size, category);
						}
						else if (choice == 3)
						{
							system("cls");//очистка консолі
							allProductsCompanyWide(d, _size);
						}
						else
						{
							cout << "Помилка" << endl;
							system("pause");//затримка консолі
							system("cls");//очистка консолі
						}
					}
					else
					{
						cout << "Данні пусті" << endl;
					}
					system("pause");//затримка консолі
					system("cls");//очистка консолі
					secondMenu();
					break;
					//////////////////////////////////////////////////////////////////
				case 15:
					system("cls");//очистка консолі
					_mainMenu = 0;
					break;
					//////////////////////////////////////////////////////////////////
				default:
					cout << "Пункт меню був вибран невірно" << endl;
					system("pause");//затримка консолі
					system("cls");//очистка консолі
					secondMenu();
				}
			}
			zeroMenu();
			break;
		}
	
	}
	return 0;
}